In [1]:
import pandas as pd

In [4]:
names=pd.Series(["Neeraj"," Suraj","Ram#","25","TATA "])

In [5]:
names.str.lower()

0    neeraj
1     suraj
2      ram#
3        25
4     tata
dtype: object

In [6]:
names.str.isdigit()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [8]:
names.str.lower().str.replace("#","")

0    neeraj
1     suraj
2       ram
3        25
4     tata
dtype: object

In [15]:
df2=pd.DataFrame(["Neeraj","Rahul","Tata","45"],columns=["Names"])
df2

    Names
0  Neeraj
1   Rahul
2    Tata
3      45

In [18]:
df2["Names"].str.lower()

0    neeraj
1     rahul
2      tata
3        45
Name: Names, dtype: object

In [20]:
name=["A,B,C","D,E"]
new_series=pd.Series(name)
new_series

0    A,B,C
1      D,E
dtype: object

In [25]:
new_series.str.split(",").str[0]

0    A
1    D
dtype: object

In [27]:
#Expand the split strings into separate columns.
new_series.str.split(",",expand=True)

   0  1     2
0  A  B     C
1  D  E  None

In [28]:
names

0    Neeraj
1     Suraj
2      Ram#
3        25
4     TATA
dtype: object

In [29]:
def cleanp(name):
    name=name.replace("#","")
    name=name.strip()
    name=name.capitalize()
    return name

In [31]:
names.apply(cleanp)

0    Neeraj
1     Suraj
2       Ram
3        25
4      Tata
dtype: object

In [34]:
names.str.replace("#","").str.strip().str.capitalize()

0    Neeraj
1     Suraj
2       Ram
3        25
4      Tata
dtype: object

# **apply has good performance as compare to str

In [38]:
my="  lknlfnaslnfa&nafa-= "

In [40]:
my.lstrip()

'lknlfnaslnfa&nafa-= '

In [41]:
my.rstrip()

'  lknlfnaslnfa&nafa-='

In [42]:
my.strip()

'lknlfnaslnfa&nafa-='

In [43]:
my.strip("-&=")

'  lknlfnaslnfa&nafa-= '